tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "shivammathur/php"
brew "ack"
brew "zstd"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "autoconf"
brew "automake"
brew "bison"
brew "black"
brew "glib"
brew "cairo"
brew "chruby"
brew "cmake"
brew "coreutils"
brew "libssh2"
brew "rtmpdump"
brew "eza"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "leptonica"
brew "libass"
brew "libbluray"
brew "pango"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "node"
brew "firebase-cli"
brew "libtool"
brew "freetds"
brew "fzf"
brew "gcc"
brew "gd"
brew "gdbm"
brew "ghostscript"
brew "git"
brew "git-gui"
brew "git-lfs"
brew "libksba"
brew "gnupg"
brew "gobject-introspection"
brew "gpgme"
brew "guile"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "libffi"
brew "libxslt"
brew "libyaml"
brew "llvm"
brew "luv"
brew "lynx"
brew "mkcert"
brew "neovim"
brew "nghttp2"
brew "numpy"
brew "opam"
brew "openshift-cli"
brew "openssl@1.1"
brew "openvino"
brew "pinentry-mac"
brew "podman"
brew "podman-compose"
brew "poppler"
brew "postgresql@14", restart_service: :changed
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "ripgrep"
brew "ruby-install"
brew "subversion"
brew "the_silver_searcher"
brew "w3m"
brew "wget"
brew "yarn"
brew "zlib"
brew "zoxide"
brew "shivammathur/php/php"
cask "amethyst"
cask "caffeine"
cask "font-dm-mono"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-fira-sans"
cask "font-greybeard"
cask "font-juliamono"
cask "font-maple-mono"
cask "freecad"
cask "ghostty"
cask "kitty"
cask "menumeters"
cask "obsidian"
vscode "achil.vscode-javascript-repl"
vscode "ahmadawais.shades-of-purple"
vscode "better-ts-errors.better-ts-errors"
vscode "bierner.markdown-mermaid"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "christian-kohler.path-intellisense"
vscode "clemenspeters.format-json"
vscode "darkriszty.markdown-table-prettify"
vscode "dbaeumer.vscode-eslint"
vscode "divlo.vscode-styled-jsx-syntax"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "gruntfuggly.todo-tree"
vscode "jackytsu.text-transformer"
vscode "jdinhlife.gruvbox"
vscode "jokela.vscode-sfz"
vscode "julielollis.vscode-jack-hdl-nand2tetris"
vscode "justusadam.language-haskell"
vscode "leafvmaple.nand2tetris"
vscode "loyio.nand2tetris-vscode"
vscode "matzar.hdl-lang"
vscode "miclo.sort-typescript-imports"
vscode "mikestead.dotenv"
vscode "misterj.vue-volar-extention-pack"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "mshr-h.veriloghdl"
vscode "neptunedesign.vs-sequential-number"
vscode "nopjmp.fairyfloss"
vscode "pranavjain.nand2tetris-hdl-visualizer"
vscode "prisma.prisma"
vscode "redhat.vscode-openshift-connector"
vscode "redhat.vscode-redhat-account"
vscode "redhat.vscode-yaml"
vscode "roblourens.vscode-nand2tetris-hdl"
vscode "sdras.vue-vscode-snippets"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "steoates.autoimport"
vscode "stylelint.vscode-stylelint"
vscode "syler.sass-indented"
vscode "tidalcycles.vscode-tidalcycles"
vscode "unifiedjs.vscode-mdx"
vscode "vitest.explorer"
vscode "vue.volar"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
