tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "ack"
brew "autoconf"
brew "automake"
brew "cmake"
brew "exa"
brew "node"
brew "firebase-cli"
brew "git"
brew "jq"
brew "libtool"
brew "neovim"
brew "nghttp2"
brew "pyenv"
brew "python@3.9"
brew "ripgrep"
brew "subversion"
brew "the_silver_searcher"
brew "wget"
brew "yarn"
brew "zstd"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-fira-sans"
cask "kitty"
