tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "shivammathur/php"
brew "ack"
brew "zstd"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "openssl@1.1"
brew "autoconf"
brew "automake"
brew "bison"
brew "glib"
brew "cairo"
brew "chruby"
brew "cmake"
brew "coreutils"
brew "libssh2"
brew "rtmpdump"
brew "curl"
brew "exa"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "leptonica"
brew "libass"
brew "libbluray"
brew "pango"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "node"
brew "firebase-cli"
brew "libtool"
brew "freetds"
brew "gd"
brew "gdbm"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "readline"
brew "gobject-introspection"
brew "python@3.10"
brew "googler"
brew "guile"
brew "jq"
brew "krb5"
brew "libffi"
brew "libksba"
brew "libpq"
brew "libyaml"
brew "python@3.11"
brew "llvm"
brew "luv"
brew "neovim"
brew "nghttp2"
brew "poppler"
brew "pyenv"
brew "python@3.9"
brew "ripgrep"
brew "ruby-install"
brew "subversion"
brew "the_silver_searcher"
brew "wget"
brew "yarn"
brew "zlib"
brew "shivammathur/php/php"
cask "caffeine"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-fira-sans"
cask "kitty"
vscode "ahmadawais.shades-of-purple"
vscode "Cardinal90.multi-cursor-case-preserve"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "Gruntfuggly.todo-tree"
vscode "JackyTsu.text-transformer"
vscode "jdinhlife.gruvbox"
vscode "jokela.vscode-sfz"
vscode "justusadam.language-haskell"
vscode "mikestead.dotenv"
vscode "MisterJ.vue-volar-extention-pack"
vscode "neptunedesign.vs-sequential-number"
vscode "nopjmp.fairyfloss"
vscode "numso.prettier-standard-vscode"
vscode "rvest.vs-code-prettier-eslint"
vscode "sdras.vue-vscode-snippets"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "steoates.autoimport"
vscode "svipas.prettier-plus"
vscode "syler.sass-indented"
vscode "tidalcycles.vscode-tidalcycles"
vscode "unifiedjs.vscode-mdx"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "Wscats.vue"
vscode "xabikos.JavaScriptSnippets"
vscode "zhuangtongfa.material-theme"
